export const FirstDataHeaderRow = [
  'ประเภทการสมัคร',
  'โครงการรับสมัคร',
  'คณะที่สมัคร',
  'ภาควิชาที่สมัคร',
  'สาขาวิชาที่สมัคร',
  'เลขที่ใบสมัคร',
  'วันที่สมัคร',
  'หมายเลขบัตรประชาชน',
  'หมายเลขหนังสือเดินทาง',
  'คำนำหน้านาม(ไทย)',
  'ชื่อ(ไทย)',
  'นามสกุล(ไทย)',
  'คำนำหน้านาม(อังกฤษ)',
  'ชื่อ(อังกฤษ)',
  'นามสกุล(อังกฤษ)',
  'เพศ',
  'สัญชาติ',
  'รหัสสถานศึกษา',
  'ชื่อสถานศึกษา',
  'จังหวัดสถานศึกษา',
  'วุฒิการศึกษาที่ใช้สมัคร',
  'สายการเรียนที่จบภายใต้วุฒิ',
  'หมายเลขโทรศัพท์',
  'อีเมล์',
  'จังหวัด',
  'GPAX',
  'ผ่านเกณฑ์การคัดเลือกจากคะแนนขั้นต่ำ',
  'คะแนนที่ไม่ผ่านตามเกณฑ์',
  'ผ่านการคัดเลือกให้จ่ายเงินค่าสมัคร',
  'มีสิทธิ์สอบข้อเขียน',
  'มีสิทธิ์สอบสัมภาษณ์',
  'สถานะผลการคัดเลือก',
  'สำรองลำดับที่',
  'มีสิทธิ์เข้าศึกษาในคณะ',
  'มีสิทธิ์เข้าศึกษาในภาควิชา',
  'มีสิทธิ์เข้าศึกษาในสาขาวิชา',
  'มีสิทธิ์เข้าศึกษา',
  'ได้เข้าศึกษา',
  'โอนไปยังระบบทะเบียน',
  'รหัสการโอนไปสู่ระบบทะเบียน',
  'สถานะการชำระเงินค่ายืนยันสิทธิ์',
  'เลขที่ใบเรียกเก็บเงินค่ายืนยันสิทธิ์',
  'วันที่ชำระเงินค่ายืนยันสิทธิ์',
  'จำนวนเงินค่ายืนยันสิทธิ์',
  'วันที่พิมพ์ใบเรียกเก็บเงิน',
  'เหตุผลในการสละสิทธิ์',
  'รายละเอียดในการสละสิทธิ์',
];

export const applicantSpreadsheetHeaderTwo = [
  'ประเภทการสมัคร',
  'โครงการรับสมัคร',
  'คณะที่สมัคร',
  'ภาควิชาที่สมัคร',
  'สาขาวิชาที่สมัคร',
  'เลขที่ใบสมัคร',
  'วันที่สมัคร',
  'หมายเลขบัตรประชาชน',
  'หมายเลขหนังสือเดินทาง',
  'คำนำหน้านาม(ไทย)',
  'ชื่อ(ไทย)',
  'นามสกุล(ไทย)',
  'คำนำหน้านาม(อังกฤษ)',
  'ชื่อ(อังกฤษ)',
  'นามสกุล(อังกฤษ)',
  'เพศ',
  'สัญชาติ',
  'รหัสสถานศึกษา',
  'ชื่อสถานศึกษา',
  'จังหวัดสถานศึกษา',
  'วุฒิการศึกษาที่ใช้สมัคร',
  'สายการเรียนที่จบภายใต้วุฒิ',
  'หมายเลขโทรศัพท์',
  'อีเมล์',
  'จังหวัด',
  'GPAX',
  'ผ่านเกณฑ์การคัดเลือกจากคะแนนขั้นต่ำ',
  'คะแนนที่ไม่ผ่านตามเกณฑ์',
  'ผ่านการคัดเลือกให้จ่ายเงินค่าสมัคร',
  'มีสิทธิ์สอบข้อเขียน',
  'มีสิทธิ์สอบสัมภาษณ์',
  'สถานะผลการคัดเลือก',
  'สำรองลำดับที่',
  'มีสิทธิ์เข้าศึกษาในคณะ',
  'มีสิทธิ์เข้าศึกษาในภาควิชา',
  'มีสิทธิ์เข้าศึกษาในสาขาวิชา',
  'มีสิทธิ์เข้าศึกษา',
  'ได้เข้าศึกษา',
  'โอนไปยังระบบทะเบียน',
  'รหัสการโอนไปสู่ระบบทะเบียน',
  'สถานะการชำระเงินค่ายืนยันสิทธิ์',
  'เลขที่ใบเรียกเก็บเงินค่ายืนยันสิทธิ์',
  'วันที่ชำระเงินค่ายืนยันสิทธิ์',
  'จำนวนเงินค่ายืนยันสิทธิ์',
  'วันที่พิมพ์ใบเรียกเก็บเงิน',
  'เหตุผลในการสละสิทธิ์',
  'รายละเอียดในการสละสิทธิ์',
  'รายการคะแนนกลุ่มสาระวิชา_คณิตศาสตร์',
  'รายการคะแนนกลุ่มสาระวิชา_วิทยาศาสตร์',
  'รายการคะแนนกลุ่มสาระวิชา_ภาษาต่างประเทศ',
  'คณิตศาสตร์',
  'วิทยาศาสตร์',
  'ภาษาต่างประเทศ',
  'คะแนนสอบสัมภาษณ์',
];

export type ApplicantSpreadsheetRow = {
  ประเภทการสมัคร: string;
  โครงการรับสมัคร: string;
  คณะที่สมัคร: string;
  ภาควิชาที่สมัคร: string;
  สาขาวิชาที่สมัคร: string;
  เลขที่ใบสมัคร: string;
  วันที่สมัคร: string;
  หมายเลขบัตรประชาชน: string;
  หมายเลขหนังสือเดินทาง: string;
  'คำนำหน้านาม(ไทย)': string;
  'ชื่อ(ไทย)': string;
  'นามสกุล(ไทย)': string;
  'คำนำหน้านาม(อังกฤษ)': string;
  'ชื่อ(อังกฤษ)': string;
  'นามสกุล(อังกฤษ)': string;
  เพศ: string;
  สัญชาติ: string;
  รหัสสถานศึกษา: string;
  ชื่อสถานศึกษา: string;
  จังหวัดสถานศึกษา: string;
  วุฒิการศึกษาที่ใช้สมัคร: string;
  สายการเรียนที่จบภายใต้วุฒิ: string;
  หมายเลขโทรศัพท์: string;
  อีเมล์: string;
  จังหวัด: string;
  GPAX: string;
  ผ่านเกณฑ์การคัดเลือกจากคะแนนขั้นต่ำ: string;
  คะแนนที่ไม่ผ่านตามเกณฑ์: string;
  ผ่านการคัดเลือกให้จ่ายเงินค่าสมัคร: string;
  มีสิทธิ์สอบข้อเขียน: string;
  มีสิทธิ์สอบสัมภาษณ์: string;
  สถานะผลการคัดเลือก: string;
  สำรองลำดับที่: string;
  มีสิทธิ์เข้าศึกษาในคณะ: string;
  มีสิทธิ์เข้าศึกษาในภาควิชา: string;
  มีสิทธิ์เข้าศึกษาในสาขาวิชา: string;
  มีสิทธิ์เข้าศึกษา: string;
  ได้เข้าศึกษา: string;
  โอนไปยังระบบทะเบียน: string;
  รหัสการโอนไปสู่ระบบทะเบียน: string;
  สถานะการชำระเงินค่ายืนยันสิทธิ์: string;
  เลขที่ใบเรียกเก็บเงินค่ายืนยันสิทธิ์: string;
  วันที่ชำระเงินค่ายืนยันสิทธิ์: string;
  จำนวนเงินค่ายืนยันสิทธิ์: string;
  วันที่พิมพ์ใบเรียกเก็บเงิน: string;
  เหตุผลในการสละสิทธิ์: string;
  รายละเอียดในการสละสิทธิ์: string;
  รายการคะแนนกลุ่มสาระวิชา_คณิตศาสตร์: string;
  รายการคะแนนกลุ่มสาระวิชา_วิทยาศาสตร์: string;
  รายการคะแนนกลุ่มสาระวิชา_ภาษาต่างประเทศ: string;
  คณิตศาสตร์: string;
  วิทยาศาสตร์: string;
  ภาษาต่างประเทศ: string;
  คะแนนสอบสัมภาษณ์: string;
};

// export type ApplicantSpreadsheetRow = {
//   [key in (typeof applicantSpreadsheetHeader)[number]]: string;
// };
